---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyError
source: html/8f9df549-593b-7ed9-0310-ea19166b66c0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyError Property

There is a circular chain of references among the highlighted elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularDependencyError { get; }
```